cavity/QHDTest/cavityRe400/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs ("libsampling.so");

interpolationScheme cellPoint;

setFormat       csv;

sets
(
    U_y
    {
        type    uniform;
        axis    x;
        start   (0 0.5 0.05);
        end     (1 0.5 0.05);
        nPoints 40;
    }

    U_x
    {
        type    uniform;
        axis    y;
        start   (0.5 0 0.05);
        end     (0.5 1 0.05);
        nPoints 40;
    }
);

fields          (U);


// ************************************************************************* //
